Repository: Coco-Gianluca/bmi_4
Catalog: lib/l10n/app_*.arb
Languages: de

# language
source: English
de: Deutsch

source: Calculate
de: Berechnen

source: Calculator
de: Rechner

# requestPersonalData
source: Please enter your personal data
de: Bitte geben Sie Ihre persönlichen Daten ein

# ifWrongNumber
source: Your height and weigh must be positive numbers
de: Ihre Grösse und Ihr Gewicht müssen eine ganze Zahl sein

# underweight
source: You are underweight
de: Sie sind untergewichtig

# fine
source: Your body is fine
de: Deinem Körper geht es gut

# overweight
source: You are overweight
de: Du bist übergewichtig

# obese
source: You are obese
de: Sie sind fettleibig

# height
source: Height (m)
de: Grösse (m)

# weight
source: Weight (kg)
de: Gewicht (kg)

source: Empty
de: Leer

source: Open Drawer
de: Öffne Menü

# title
source: Welcome
de: Wilkommen

source: Your History
de: Dein Verlauf

source: What is BMI?
de: Was ist BMI?

# explanationBMI
source: Your BMI is a number based on your height, weight and age. Each of these are divided into three categories: under 18.5, 18.5-24 and 25-29.9. For women it is considered normal to be around 18.5 and 25 for men to be over 30. A reading of over 30 is considered overweight. For example, if you are a woman and have a BMI of 24.9 then you are considered overweight.Weight gain over the last year is common for most people in their mid-thirties. More specifically, women are at a higher risk of gaining weight than men. A study by the International Journal of Epidemiology (IJE) examined how BMI has changed from 1985-1995. The results revealed a very significant rise in weight gain amongst women aged 30 and above, and this was found to be both a cause and consequence of life events. Drinking habits have changed dramatically over the last 20 years. More and more women are choosing to drink more wine than beer. This results in women having a higher rate of alcohol intake than men.
de: Ihr BMI ist eine Zahl, die auf Ihrer Größe, Ihrem Gewicht und Ihrem Alter basiert. Jede davon ist in drei Kategorien unterteilt: unter 18,5, 18,5-24 und 25-29,9. Bei Frauen gilt ein Wert um die 18,5 als normal, bei Männern ab 30 bei 25. Ein Wert von über 30 gilt als Übergewicht. Wenn Sie beispielsweise eine Frau sind und einen BMI von 24,9 haben, gelten Sie als übergewichtig. Gewichtszunahme im letzten Jahr ist für die meisten Menschen Mitte dreißig üblich. Genauer gesagt haben Frauen ein höheres Risiko, an Gewicht zuzunehmen als Männer. Eine Studie des International Journal of Epidemiology (IJE) untersuchte, wie sich der BMI von 1985 bis 1995 verändert hat. Die Ergebnisse zeigten eine sehr signifikante Zunahme der Gewichtszunahme bei Frauen ab 30 Jahren, die sowohl Ursache als auch Folge von Lebensereignissen war. Die Trinkgewohnheiten haben sich in den letzten 20 Jahren dramatisch verändert. Immer mehr Frauen entscheiden sich dafür, mehr Wein als Bier zu trinken. Dies führt dazu, dass Frauen einen höheren Alkoholkonsum haben als Männer.

# ratingVerySeverelyUnderweight
source: very severely underweight
de: Sehr stark untergewichtig

# ratingSeverelyUnderweight
source: Severely underweight
de: Stark untergewichtig

# ratingModeratelyUnderweight
source: Moderately underweight
de: Leicht untergewichtig

# ratingSlightlyUnderweight
source: Slightly underweight
de: Etwas untergewichtig

# ratingNormal
source: Normal (healthy weight)
de: Normal (gesundes Gewicht)

# ratingOverweight
source: Overweight
de: Übergewicht

# ratingModeratelyOverweight
source: Moderately overweight
de: Leicht übergewichtig

# ratingModeratelyObese
source: Moderately obese(class I)
de: Mässig fettleibig (Klasse I)

# ratingSeverelyObese
source: Severely obese(class II)
de: Stark fettleibig (Klasse II)

# ratingVerySeverelyObese
source: 'Very severely obese(class III)
de: Sehr Stark fettleibig (Klasse III)

source: Ratings
de: Bewertungen

source: Ratings Details
de: Bewertungs Informationen
